# 📘 HR Database – Solutions (Part 2)

This notebook contains the SQL solutions for the HR schema use cases (15–23).

#### 🔹 Use Case 15
> Find the **average, sum, maximum, and minimum salary** of all employees.

In [ ]:
SELECT salary FROM employees;

In [ ]:
SELECT AVG(salary)
FROM employees;

In [ ]:
SELECT ROUND(AVG(salary),2), SUM(salary), MIN(salary), MAX(salary)
FROM employees;

#### 🔹 Use Case 16
> Find the **count of employees** and the **count of departments**.

In [ ]:
SELECT COUNT(*) FROM employees;

In [ ]:
SELECT COUNT(*) FROM departments;

#### 🔹 Use Case 17
> Find the **count of department IDs** in the `employees` table.

In [ ]:
SELECT COUNT(department_id) FROM employees;

In [ ]:
SELECT COUNT(commission_pct) FROM employees;

In [ ]:
SELECT COUNT(DISTINCT department_id) FROM employees;

In [ ]:
SELECT COUNT(DISTINCT manager_id) FROM employees;

#### 🔹 Use Case 18
> Find the **average salary** for all employees in each department, where the average salary is **greater than 5000**.

In [ ]:
SELECT department_id, ROUND(AVG(salary),2) AS "avg sal"
FROM employees
WHERE department_id IS NOT NULL
GROUP BY department_id
HAVING AVG(salary) > 5000
ORDER BY AVG(salary);

In [ ]:
SELECT department_id, ROUND(AVG(salary),2) AS "avg sal"
FROM employees
WHERE department_id IS NOT NULL
GROUP BY department_id
HAVING AVG(salary) > 5000
ORDER BY "avg sal";

In [ ]:
-- Bonus: Under each manager, find the total no. of employees working under them
SELECT manager_id, COUNT(*)
FROM employees
WHERE manager_id IS NOT NULL
GROUP BY manager_id;

In [ ]:
-- Bonus: Find manager_id's with 5 or more employees
SELECT manager_id, COUNT(*)
FROM employees
WHERE manager_id IS NOT NULL
GROUP BY manager_id
HAVING COUNT(*) >=5;

#### 🔹 Functions Exploration
> Demonstrating single-row and date functions on the HR schema.

In [ ]:
SELECT CONCAT('Hello', 'World') FROM dual;

In [ ]:
SELECT SUBSTR('HelloWorld',1,5) FROM dual;

In [ ]:
SELECT SUBSTR('1234-5678-9000-8765',16,4) FROM dual;

In [ ]:
SELECT LPAD(24000,10,'X') FROM dual;

In [ ]:
SELECT RPAD(24000,10,'X') FROM dual;

In [ ]:
SELECT LPAD(SUBSTR('1234-5678-9000-8765',16,4),16,'X') FROM dual;

In [ ]:
SELECT last_name, hire_date
FROM employees
WHERE hire_date < '01-FEB-88';

In [ ]:
SELECT SYSDATE FROM dual;

In [ ]:
SELECT last_name, ROUND(((SYSDATE-hire_date)/7),2) AS WEEKS
FROM employees
WHERE department_id = 90;

In [ ]:
SELECT SYSDATE + 10 FROM dual;

In [ ]:
SELECT SYSDATE - 10 FROM dual;

In [ ]:
SELECT last_name, ROUND(MONTHS_BETWEEN(SYSDATE, hire_date),2)
FROM employees;

In [ ]:
SELECT ADD_MONTHS(SYSDATE,-10) FROM dual;

In [ ]:
SELECT NEXT_DAY(SYSDATE, 'fri') FROM dual;

In [ ]:
SELECT LAST_DAY(SYSDATE) FROM dual;

In [ ]:
SELECT hire_date, last_name, LAST_DAY(ADD_MONTHS(hire_date,6))-1 AS "first incr date"
FROM employees
WHERE LOWER(last_name) = 'whalen';

#### 🔹 Use Case 19
> Find the **employee name** and the **department name** in which the employee is working.

In [ ]:
SELECT last_name, department_name
FROM employees JOIN departments
ON employees.department_id = departments.department_id;

#### 🔹 Use Case 20
> Find the **salary** and the **region name** in which employee **Ernst** is working.

In [ ]:
SELECT salary, region_name
FROM employees e JOIN departments d
ON e.department_id = d.department_id
JOIN locations l ON d.location_id = l.location_id
JOIN countries c ON l.country_id = c.country_id
JOIN regions r ON c.region_id = r.region_id
WHERE last_name = 'Ernst';

#### 🔹 Use Case 21a
> Find all **department names** and the **manager names** of each department.

In [ ]:
SELECT department_name, last_name AS "manager name"
FROM employees JOIN departments
ON departments.manager_id = employees.employee_id;

In [ ]:
-- Bonus: Departments with more than 10 employees
SELECT department_name, COUNT(*)
FROM employees e JOIN departments d
ON e.department_id = d.department_id
GROUP BY department_name
HAVING COUNT(*) >= 10;

In [ ]:
-- Bonus: Total salary by country
SELECT country_name, SUM(salary), COUNT(*)
FROM employees e JOIN departments d
ON e.department_id = d.department_id
JOIN locations l ON d.location_id = l.location_id
JOIN countries c ON c.country_id = l.country_id
GROUP BY country_name;

#### 🔹 Use Case 21b
> Find all **department names** and the **manager names** of each department, including departments that **do not have managers**.

In [ ]:
SELECT department_name, last_name AS "mgr name"
FROM employees RIGHT JOIN departments
ON employees.employee_id = departments.manager_id;

In [ ]:
-- Demonstrating different join types
SELECT last_name, department_name
FROM employees e FULL JOIN departments d
ON e.department_id = d.department_id;

In [ ]:
SELECT last_name, department_name
FROM employees e LEFT JOIN departments d
ON e.department_id = d.department_id;

In [ ]:
SELECT last_name, department_name
FROM employees e RIGHT JOIN departments d
ON e.department_id = d.department_id;

#### 🔹 Use Case 22
> Find all **department names** which do **not have any employees**.

In [ ]:
SELECT department_name
FROM departments d
WHERE NOT EXISTS (
    SELECT 1 FROM employees e WHERE e.department_id = d.department_id
);

#### 🔹 Use Case 23
> Find the **names of employees** who are **not managing any department**.

In [ ]:
SELECT last_name, first_name
FROM employees e
WHERE NOT EXISTS (
    SELECT 1 FROM departments d WHERE d.manager_id = e.employee_id
);